============
Single line
============

'1234Hello WOrld'

---

(source_file (charlist))

============
Single line with escaped quote
============

'escape \' quote'

---

(source_file (charlist))

============
Multi line
============

'''
Hello

 This is multi line.
'''

---

(source_file (charlist))

============
Multi line with internal quote
============

'''
Hello

This isn't a string.

It's a charlist
'''

---

(source_file (charlist))


