===========
List - Empty list
===========

[]

---

(source_file (expression (list)))

===========
List With Elements
===========

[1, 2, 3]
[true, "hello", 3]
[
  true,
  [1, 2, 3]
]

---

(source_file
  (expression (list (number) (number) (number)))
  (expression (list (boolean) (string) (number)))
  (expression (list (boolean) (list (number) (number) (number)))))

===========
List - Error
===========

[1 2]

---

(source_file (expression (list (number) (ERROR))))

====================
List - Trailing Separator
====================

[1,2,3,]

---

(source_file (expression (list (number) (number) (number))))