===========
empty
===========

%{}

---

(source_file (map))


================================================================================
with one key and value
================================================================================

%{ :hello => "world" }

--------------------------------------------------------------------------------

(source_file
  (map
    (map_entry
        (atom) (string))))

================================================================================
with many keys and values
================================================================================

%{ hello: :joe, goodbye: "moe" }

--------------------------------------------------------------------------------

(source_file
  (map
    (map_entry (atom) (atom))
    (map_entry (atom) (string))))


====================
error
====================

%{1 2}

---

(source_file (map (ERROR (number) (number))))

