============
Module function zero arity function
============

def test do
end

---

(source_file (def (identifier) (do_block)))

============
Module function zero arity function with parens
============

def test() do
end

---

(source_file (def (identifier) (do_block)))

============
Module function single arity function
============

def test(name) do
end

---

(source_file (def (identifier) (variable) (do_block)))

============
Module function plural arity function
============

def test(first_name, last_name) do
end

---

(source_file (def (identifier) (variable) (variable) (do_block)))

============
Module function short hand function
============

def test(), do: "Hello world"

---

(source_file (def (identifier) (do_block (string))))