============
zero arity function
============

def test do
end

---

(source_file (def (identifier) (do_block)))

============
zero arity function with parens
============

def test() do
end

---

(source_file (def (identifier) (do_block)))

============
single arity function
============

def test(name) do
end

---

(source_file (def (identifier) (variable) (do_block)))

============
plural arity function
============

def test(first_name, last_name) do
end

---

(source_file (def (identifier) (variable) (variable) (do_block)))