============
Sigil empty
============

~r<>

---

(source_file (expression (sigil)))

============
Sigil string
============

~s"1234Hello WOrld"

---

(source_file (expression (sigil)))

============
Sigil braced
============

~s{1234Hello WOrld}

---

(source_file (expression (sigil)))

============
Sigil multiline
============

~q"""
Hello

 This is multi line.
"""

---

(source_file (expression (sigil)))

============
Sigil regex with modifier
============

~r/[a-z]/fisum

---

(source_file (expression (sigil)))

============
Sigil accepts only single char
============

~error(a-z)

---

(source_file (ERROR (UNEXPECTED 'r') (computed_function_name (expression (variable)) (ERROR))))