============
Single line
============

"1234Hello WOrld"

---

(source_file (string))

============
Single line with escaped double quote
============

"1234Hello \" WOrld"

---

(source_file (string))

============
Multi Line
============

"""
Hello

 This is multi line.
"""

---

(source_file (string))

============
Multi Line with internal double quotes
============

"""
A multi line string:

"A string which spans multiple lines,
opened and closed by tripple double quotation marks (")"
"""

---

(source_file (string))
